app/Http/Controllers/Admin/AjaxController.php

select `mmc_classid` from `mmc_classes` where `mmc_classname` = 'TKĐH K18' limit 1
---
    public function getClass(Request $request)
    {
        $classid=mmc_class::where('mmc_classname','=',$request->name)->get();
        $students=mmc_student::where('mmc_classid','=',$classid[0]->mmc_classid)->get();