app/Http/Controllers/Admin/AjaxController.php

update `scienceemployees` set `mmc_status` = 1, `scienceemployees`.`updated_at` = '2019-12-27 09:06:19' where `id` = 1
---
    public function getUpdate(Request $request)
    {
        $scienceemployee = scienceemployee::findOrFail($request->id);
        $scienceemployee['mmc_status']=1;
        $scienceemployee->update();