app/Http/Controllers/Admin/calendarController.php

select * from `mmc_subjectclasses` where `mmc_subjectclasses`.`mmc_employeeid` in ('MMC_GV_01', 'MMC_GV_26', 'MMC_GV_27', 'MMC_GV_28', 'MMC_GV_29', 'MMC_GV_30', 'MMC_GV_31', 'MMC_GV_32', 'MMC_GV_33', 'MMC_GV_34', 'MMC_GV_35', 'MMC_GV_36', 'MMC_GV_37', 'MMC_GV_38', 'admin')
---
    public function index()
    {
        $data= mmc_employee::with('subjectclass.subject')->get();