app/Http/Controllers/Admin/DepartmentController.php

    public function store(Request $request)
    {
        $this->validate($request,[
            'mmc_deptname'=>'required|unique:mmc_departments,mmc_deptname',
        ],[
            'mmc_deptname.required'=>'Tên bộ môn hông được bỏ trống',
            'mmc_deptname.unique'=>'Tên bộ môn đã tồn tại'
        ]);
        $department=new mmc_department();
        $department->mmc_deptid="mmc-".Str::slug($request->mmc_deptname);
        $department->mmc_deptname=$request->mmc_deptname;
        $department->mmc_description=$request->mmc_description;
        $department->save();
---
insert into `mmc_departments` (`mmc_deptid`, `mmc_deptname`, `mmc_description`, `updated_at`, `created_at`) values ('mmc-ky-thuat-phan-mem', 'Ky thuat phan mem', '', '2019-12-13 16:17:59', '2019-12-13 16:17:59')