app/Http/Controllers/Admin/EducationProgramController.php

select `mmc_majorid` from `mmc_majors` where `mmc_majorname` LIKE '%a%'
---
    public function index(Request $request)
    {
        $keyword = $request->get('search');
        $perPage = 5;
        if (!empty($keyword)){
            $major= mmc_major::where('mmc_majorname', 'LIKE', "%$keyword%")->pluck('mmc_majorid');
            $education = mmc_education::whereIn('mmc_major',$major)->latest()->paginate($perPage);