app/Http/Controllers/Admin/GiangVienController.php

    public function getThemGV(){
        $bomon = mmc_department::select('mmc_deptid','mmc_deptname')->get();

        // lấy mã giảng viên tự động tăng
        $id  = DB::table('mmc_employees')->max('id');
---
select max(`id`) as aggregate from `mmc_employees`