app/Http/Controllers/Admin/MajorController.php

    public function store(Request $request)
    {

        $rgb=substr($request->car_color,1,6);
        $split = str_split($rgb, 2);
        $r = hexdec($split[0]);
        $g = hexdec($split[1]);
        $b = hexdec($split[2]);
        $this->validate($request,[
            'mmc_majorid'=>'required|unique:mmc_majors',
            'mmc_majorname'=>'required|unique:mmc_majors',
        ],[
            'mmc_majorid.required'=>'Mã ngành hông được bỏ trống',
            'mmc_majorid.unique'=>'Mã ngành đã tồn tại',
            'mmc_majorname.required'=>'Tên ngành hông được bỏ trống',
            'mmc_majorname.unique'=>'Tên ngành đã tồn tại'
        ]);
        $major=new mmc_major();
        $major->mmc_majorid=$request->mmc_majorid;
        $major->mmc_deptid=$request->mmc_deptid;
        $major->mmc_majorname=$request->mmc_majorname;
        $major->mmc_description=$request->mmc_description;
        $major->r=$r;
        $major->g=$g;
        $major->b=$b;
        $major->save();
---
insert into `mmc_majors` (`mmc_majorid`, `mmc_deptid`, `mmc_majorname`, `mmc_description`, `r`, `g`, `b`, `updated_at`, `created_at`) values ('7320116', 'mmc-game-ngoai', 'BonBon', '', 0, 243, 255, '2019-12-18 11:19:25', '2019-12-18 11:19:25')