app/Http/Controllers/Admin/ScienceEmployeeController.php

    public function store(Request $request)
    {
        $this->validate($request,[
            'mmc_file'=>'mimes:pdf',
        ],[
            'mmc_file.mimes'=>'Không phải file pdf',
        ]);
        $file=$request->mmc_file;
        $file->move('PDF/',$file->getClientOriginalName());
        $scienceemployee=new scienceemployee();
        $scienceemployee->mmc_file=$file->getClientOriginalName();
        $scienceemployee->mmc_employeeid=Auth::user()->mmc_employeeid;
        $scienceemployee->mmc_missionid=$request->mmc_mission;
        $scienceemployee->mmc_link=$request->mmc_link;
        $scienceemployee->mmc_status=0;
        $scienceemployee->save();
---
insert into `scienceemployees` (`mmc_file`, `mmc_employeeid`, `mmc_missionid`, `mmc_link`, `mmc_status`, `updated_at`, `created_at`) values ('80661107_568705980530029_404682341298995200_o.jpg', 'admin', '3', 'https://stackoverflow.com/questions/35203019/how-can-i-send-an-ajax-request-on-button-click-from-a-form-with-2-buttons', 0, '2019-12-27 08:41:46', '2019-12-27 08:41:46')